//
//  Phase.cpp
//  SixBySix
//
//  Created by 岡本幸二 on 2016/07/09.
//
//

#include "SixBySix.hpp"

//================================================================================================
//スタートフェイズ
//================================================================================================
//フェイズ切り替え時に呼ばれる関数
void CStartPhaes::start(){
    
}

//更新処理
void CStartPhaes::update(){
    
}

//フェイズ終了時に呼ばれる関数
void CStartPhaes::end(){
    
}


//================================================================================================
//メインフェイズ
//================================================================================================
//フェイズ切り替え時に呼ばれる関数
void CMainPhaes::start(){
    
}
    
//更新処理
void CMainPhaes::update(){
    
}
    
//フェイズ終了時に呼ばれる関数
void CMainPhaes::end(){
    
}


//================================================================================================
//バトルフェイズ
//================================================================================================
//フェイズ切り替え時に呼ばれる関数
void CBattlePhaes::start(){
    
}
    
//更新処理
void CBattlePhaes::update(){
    
}
    
//フェイズ終了時に呼ばれる関数
void CBattlePhaes::end(){
    
}


//================================================================================================
//エンドフェイズ
//================================================================================================
//フェイズ切り替え時に呼ばれる関数
void CEndPhaes::start(){
    
}
    
//更新処理
void CEndPhaes::update(){
    
}
    
//フェイズ終了時に呼ばれる関数
void CEndPhaes::end(){
    
}


//実態宣言
CPhaesManager* CPhaesManager::m_pManager = NULL;


