//
//  CardUI.cpp
//  6x6
//
//  Created by 辰巳優太 on 2016/06/08.
//
//

#include "SixBySix.hpp"


// ===================================================================================================================
// カード表示
// デッキや手札を表示するクラス
// カードをクリックした時に呼ばれる関数はこのクラスに実装する
// このクラスを継承して デッキ、手札、墓地 の表示クラスを作る
// ===================================================================================================================
/**
 @desc		アイコンの生成
 */
void CUI_Card::createIcon() {
	
}


/**
 @desc		すべてのアイコンの表示・非表示
 @param		表示するかどうか
 */
void CUI_Card::setVisibleIcon( bool isVisible ) {
	
	for ( auto pIcon : this->m_icons ) {
		pIcon->setVisible( isVisible ) ;
	}
	
}