//
//  CardUI.hpp
//  6x6
//
//  Created by 辰巳優太 on 2016/06/08.
//
//

#ifndef CardUI_hpp
#define CardUI_hpp


#include "UI_Item.hpp"


// ===================================================================================================================
// カード表示
// デッキや手札を表示するクラス
// カードをクリックした時に呼ばれる関数はこのクラスに実装する
// このクラスを継承して デッキ、手札、墓地 の表示クラスを作る
// ===================================================================================================================
class CUI_Card : public CUI_Sprite {
protected:
	// 拡大率
	float m_scaleRate = 1.05f ;
	
	// アイコン等のスプライト群
	std::vector<cocos2d::Sprite*> m_icons ;
    // 枚数や数値などのラベル群
	std::vector<cocos2d::Label*> m_labels ;
	
	
	// =========================================================
	// アイコン・ラベル関連
	// =========================================================
	/**
	 @desc		アイコンの生成
	 */
	virtual void createIcon() ;
	
	/**
	 @desc		すべてのアイコンの表示・非表示
	 @param		表示するかどうか
	 */
	virtual void setVisibleIcon( bool isVisible ) ;
	
};






#endif /* CardsUI_hpp */
