//
//  CardEffect.h
//  SixBySix
//
//  Created by 宇山翔 on 2016/07/09.
//
//

#pragma once


//================================================================================================
//追加インクルード
//================================================================================================
#include "CardStatus.h"

//前方宣言
class CStatus;

//================================================================================================
//カード効果基底クラス
//================================================================================================
class CCardEffect{
protected:
    //カードステータスを受け取る変数
    CCardStatus* m_Status = NULL ;
    
public:
    ~CCardEffect();
    
    /**
     *  @desc   カードの効果発動
     *  @param  カード効果を受ける相手のステータス
     */
    virtual void runEffect( CStatus *pStatus ) = 0 ;
};


//================================================================================================
//敵プレイヤーへの攻撃
//================================================================================================
class CPlayerAttackEffect : public CCardEffect {
public:
    /**
     @desc      コンストラクタ
     @param     効果のステータス
     */
    CPlayerAttackEffect( CCardStatus* pStatus );
    
    /**
     *  @desc   カードの効果発動
     *  @param  カード効果を受ける相手のステータス
     */
    void runEffect( CStatus *pStatus ) override;
};
//================================================================================================
//オブジェクトへの攻撃
//================================================================================================
class CObjectAttackEffect : public CCardEffect {};


//================================================================================================
//効果範囲
//================================================================================================
class CEffectRangeEffect : public CCardEffect {};

//================================================================================================
//オブジェクト設置
//================================================================================================

class CSettingObjectEffect : public CCardEffect {};

//================================================================================================
//パネル移動
//================================================================================================
class CPanelMoveEffect : public CCardEffect {};

//================================================================================================
//バフ
//================================================================================================
class CBuffEffect : public CCardEffect {
public:
    /**
     @desc      コンストラクタ
     @param     効果のステータス
     */
    CBuffEffect( CCardStatus* pStatus );
    
    /**
     *  @desc   カードの効果発動
     *  @param  カード効果を受ける相手のステータス
     */
    void runEffect( CStatus *pStatus ) override;
};

//================================================================================================
//デバフ
//================================================================================================

class CDeBuffEffect : public CCardEffect {
public:
    /**
     @desc      コンストラクタ
     @param     効果のステータス
     */
    CDeBuffEffect( CCardStatus* pStatus );
    
    /**
     *  @desc   カードの効果発動
     *  @param  カード効果を受ける相手のステータス
     */
    void runEffect( CStatus *pStatus ) override ;
};

//================================================================================================
//ドロー
//================================================================================================
class CDrawEffect : public CCardEffect {};
