//
//  GameMain.hpp
//  SixBySix
//
//  Created by 安田一朗太 on 2016/06/05.
//
//

#pragma once

//================================================================================================
//追加インクルード
//================================================================================================

#include "test.hpp"


//================================================================================================
//ゲームメインレイヤー
//================================================================================================
class CGameMainLayer : cocos2d::Layer{
protected:
    //コンストラクタ
    CGameMainLayer();
    //デストラクタ
    ~CGameMainLayer();
    
    //初期化
    bool init() override;
    
    //インスタンス生成
    static CGameMainLayer *create();
    
    //入場処理
    void onEnter() override;
    
    //退場処理
    void onExit() override;
    
    //更新処理
    void update( float deltaTime ) override;
    
public:
    //シーン生成
    static cocos2d::Scene *createScene();

    
    
public:
    //================================================================================================
    //メンバ変数とメンバ関数の追加
    //================================================================================================
    //メインレイヤー
    cocos2d::Layer *m_pMainLayer = NULL;
    
};