//
//  UI_Hand.hpp
//  SixBySix
//
//  Created by 辰巳優太 on 2016/07/16.
//
//

#ifndef UI_Hand_hpp
#define UI_Hand_hpp

#include "UI_Card.hpp"


// ===================================================================================================================
// 手札表示
// CCardUI クラスを継承した手札を表示するクラス
// ===================================================================================================================
class CUI_Hand : public CUI_Card {
public:
	CREATE_FUNC( CUI_Hand ) ;

	// 初期化
	bool init() override ;
	
	
	// =========================================================
	// マウスイベント関連
	// =========================================================
protected:
	/**
	 @desc		マウスカーソルが重なった時の処理
	 */
	void beginOverLap() override ;
	
	/**
	 @desc		マウスカーソルが離れた時の処理
	 */
	void endOverLap() override ;
	
	
	// =========================================================
	// アイコン関連
	// =========================================================
	/**
	 @desc		アイコンの生成
	 */
	void createIcon() override ;
	
	
};

#endif /* UI_Hand_hpp */
